// js 안에 기본적으로 내장되어있는 객체
// Math() => 수학객체
// Date() => 날짜객체

// Date() => 날짜객체

// class = 클래스
// 자주 반복적으로 빈번하게 유사한 형태의 객체를 만들어서 사용해야하는 경우. 일일히 그때마다 객체를 생성해야하는 비효율성을 개선하기 위해서 class를 사용

// Class 를 통해서 객체의 모델을 하나 생성해야함

// 모델 => 실제 객체로서의 역할 X

// 다만, 해당 모델을 가져다가 사용을 하면, 객체(*최초에 설정해놓은 모델이 가지고 있는 속성 & 메서드 함수를 그대로 상속받아서 사용할 수 있는)가 탄생

// Class를 통해서 만들어진 모델을 가져다가 사용할 때에는 반드시 규칙!! - new라는 예약어 사용

// Class를 통해서 만들어진 해당 모델 => Prototype(프로토타입)이라고 부름

// new Date()
//  Wed Feb 12 2025 11:15:52 GMT+0900 (한국 표준시) {}

let arr = new Array(); // 배열
console.log(arr);

const arr01 = [1, 2, 3]; // 배열 약식

// 자바스크립트 내부에서 시간 관련딘 무언가를 할 때 반드시 인지해야하는 기본 싱식

// 대부분의 프로그래밍 언어에서는 시간을 인간친롸적인 방식으로 카운터를 하지않음

// 밀리초 = ms 단위 개념

// 1초 = 1000밀리초
// 1분 = 60 * 1000 = 60,000밀리초
// 1시간 = 60 * 60 * 1000 = 3,600,000밀리초
// 1일 = 24 * 60 * 60 * 1000 = 86,400,000밀리초

// 자바스크립트는 지금 이순간에도 우리의 인간계 시간을 밀리초로 변환해서 계산

// 자바스크립트 = 1970년 1월 1일 을 기준으로 밀리초가 쌓임
